package day01;
// 자바의 이름짓는 규칙(Naming Convention)

// 공통 규칙
//  1. 자바는 50여 가지의 예약어(keyword)가 있고, 해당 예약어에는 자바가 내부적으로 지정한 프로그래밍적 기능이 있기 때문에
//     해당 예약어로는 우리가 이름을 지어줄 수 없다. 이클립스에서는 예약어를 자주색으로 표시해준다.
//     예) public, class, package...
//     만약 어떠한 이름을 지어주는데 해당 이름이 보라색으로 출력이 되면, 변형을 가해주거나 아예 다른 단어를 붙여줘야 한다.
//  2. 자바에서는 대소문자를 엄격하게 구분한다.
//     즉, Member와 member는 스펠링은 같지만 대소문자가 다르기 때문에 다른 존재가 된다.
//  3. 이름의 시작은 숫자나 특수문자가 될 수 없다.
//  4. 한글이 포함된 이름은 피하자
//  5. 중복되는 이름 사용 금지

// 낙타등 표기법: 여러 단어로 이루어진 이름의 경우, 두번째 단어부터는 첫 글자를 대문자로 적어서 단어의 구별을 쉽게 하는 이름짓기 규칙 
//            예) firstNumber, MemberController, selectAll() ....
// 뱀 표기법: 모든 글자를 대문자로 적어주고, 단어의 사이에는 _를 끼워넣는 방법이다.
//         예) PI, UNIT_PRICE, FILE_PATH ....

// 클래스 이름 규칙: 클래스는 낙타등 표기법을 사용하고 대문자로 시작하는 명사이다.
//              예) Ex03Naming, Scanner, ArrayList ....
// 변수 이름 규칙: 변수는 낙타등 표기법을 사용하고 소문자로 시작하는 명사이다.
//             예) myNumber, number, scanner ....
// 메소드 이름 규칙: 메소드는 낙타등 표기법을 사용하고 소문자로 시작하는 동사이다. 또한 메소드는 무조건 이름 뒤에 ()가 붙는다.
//              예) println(), selectAll(), nextInt(), main() ....
// 상수 이름 규칙: 상수는 뱀 표기법을 사용하고 명사이다.
//             예) PI, UNIT_PRICE, FILE_PATH ....

public class Ex03Naming {

}
